/* 
Задача 1. Синтаксис объектов:
 - пустой объект user;
 - добавляем в объект следующие свойство: name, surname, age, city
      (значением свойств твоё имя, фамилия, возраст и город);
 - поменять значение age;
 - удалить свойство city из объекта;
*/

/*
Задача 2. Работа с датами.
2.1 Вывести текущий день
2.2 Вывести текущий месяц
2.3 Вывести текущий год
2.4 Вывести номер текущего дня недели
2.5 Определить какой сегодня день недели (понедельник, вторник ...)
2.6 Определить в какой день недели вы родились.
2.7 Вывести количество часов, которое осталось до 20:00. 
2.8 В зависимости от времени вывести на экран Доброе утро (до 10:00), Добрый день (до 17:00), Добрый вечер.
2.9 Создать дату 23.07.1991 и вывести на консоль. 
2.10 На основе текущей даты и даты рождения вычислить возраст.
*/

/*
Задача 3. 
Сформировать объектов, описывающий, работника компании.
Объекте должен содержать следующие свойства (поля):
 - поле firstName (имя сотрудника)
 - поле lastName (фамилия сотрудника)
 - поле middleName (отчество сотрудника)
 - поле dateOfBirth
 - поле salary (зарплата сотрудника)
 У объекта есть функция, которая возвращает возраст человека
*/

/*
Задача 4. 
Создать массив объектов. За основу использовать объект из задачи 3.
Вывести на экран массив:
| № | Фамилиия | Имя | Возраст |
| 1 | Петров | Иван | Алексеевич |
| 2 | Марков | Алекс | Петрович |
            ...
| n | Селезнёва | Анна | Викторовна |
         
*/

/*
Задача 5. 
Создать функцию в которую будет передан в качестве аргумента массив из задачи 4
и возвращен из функции массив содержащий имена всех сотрудников, 
чья зарплата превышает 4000.
 ["Петров", "Марков"]
*/

/*
***Задача 6.
Создать объект человек. Объект содержит свойства: имя, возраст, позиция по работе.
Добавить методы к объекту:
1) Бегает.
2) Сидит.
3) Думает.

*/
