/* Задача 1.  Дана строка 'Работа со строками'. 
Найти количество символов в данной строке. */

/* Задача 2. Дана строка 'https://learn.javascript.ru/string'. 
Нужно вывести learn.javascript.ru тремя разными способами (через substr, substring, slice).*/

/* Задача 3.  Дана строка 'Работа со строками'. Найдите позицию подстроки «со».*/

/* Задача 4.  Дана переменная str, в которой хранится любой текст. 
Реализуй обрезание длинного текста по следующему принципу: 
если количество символов этого текста больше 5, 
то в переменную result запишем первые 5  символов строки str и добавим в конец троеточие '...'. 
В противном случае в переменную result запишем содержимое переменной str.*/

/* Задача 5.  Дана строка "Работа со строками". С помощью метода split запишите каждое 
слово этой строки в отдельный элемент массива */

/* Задача 6. В переменной date сохранена дата в формате '2019-04-01'. 
Преобразуйте эту дату в формат '01/04/2019'. (использовать split) */

/* Задача 7.  Дан массив ['Работа', 'со', 'строками']. С помощью метода 
join преобразуйте массив в строку 'Работа-со-строками' */

/* Задача 8. Дана строка 'brave developers'. 
Сделать из нее строку 'BRAVE DEVELOPERS'.*/

/* Задача 9. Дана строка 'BRAVE DEVELOPERS'. 
Сделать из нее строку 'brave developers'.*/

/* Задача 10. Дана строка 'brave developers'. 
Преобразовать первую букву каждого слова строки в верхний регистр*/

/* Задача 11. Дана строка "email: test@test.com"
Заменить 'email' на 'адрес' с помощью замены.*/

/*Задача 12.  Преобразуйте строку 'old_date_document' в 'oldDateDocument'. 
Код должен работать с любыми аналогичными строками.*/

/* Задача 13.  Создать переменную, в которой хранится один символ. Вывести его код.*/
