/*
Задача 1. Объявить следующий массив [42, 65, 49, 68, 56, 47, 70]. 
Вывести длину массива.
Вывести значения всех элементов массива и соответствующие им индексы: 
Индексу 0 - соответствует число 42
Индексу 1 - соответствует число 65 
и т.д... 
*/

/*
Задача 2. Объявить следующий массив ["Mango", "Poly", "Ajax"]. Заменить второй элемент на “JavaScript”
*/

/*
Задача 3.  Задан массив [18, 27, 35, 41]. Добавить в конец массива следующие элементы 13, 77, 56
*/

/*
Задача 4.  Задан массив [18, 27, 35, 41]. Добавить в начало массива следующие элементы 13, 77
*/

/* 
Задача 5. Задан массив ['startfish', 'earthworm', 'sea urchin', 'jellyfish', 'snail']. 
Удалить первый элемент масива и вывести значение удаленного элемента.
*/

/* 
Задача 6. Задан массив ['startfish', 'earthworm', 'sea urchin', 'jellyfish', 'snail']. 
Удалить последний элемент масива. вывести массив после удаления.
*/

/* 
Задача 6. Задана строка 'ostopus,snail,lobster,perch,catfish,shark'. 
Преобразовать строку в массив. Вывести значения всех элементов массива и соответствующие им индексы.
*/

/*
Задача 7. Дан массив ['side', 'back', 'front']. 
Создать из массива строку следующего вида: 'side view, back view, front view'.
*/

/*
Задача 8. Задан массив ['side', 'back', 'front'].  Удалить второй элемент.
*/

/*
Задача 9.  Задан массив ['startfish', 'earthworm', 'sea urchin', 'jellyfish', 'snail'].
С помощью метода splice сделай из него массив  ['startfish', 'jellyfish', 'snail']
*/

/*
Задача 10.
Задан массив ['startfish', 'earthworm', 'sea urchin', 'jellyfish', 'snail'].
Удалить первый 2 элемента, вместо них добавить следующее 'perch', 'goldfich'
*/

/*
Задача 11.
Задан массив ['startfish', 'earthworm', 'sea urchin', 'jellyfish', 'snail'].
После элемента  'sea urchin', добавить следующие элементы 'discus', 'catfish'
*/

/*
Задача 12.
Задан массив let arr= ['snake', 'turtle', 'cobra', 'viper', 'boa' ]
Скопировать элементы 'turtle', 'cobra' в новый массив.
*/

/*
Задача 13.
Дан массив [3,4,5-7,4,0,-6]
Вывести отсортированный массив по возрастанию и убыванию.
*/

/*
Задача 14.
Задан массив let arr= ['sea urchin', 'jellyfish', 'snail']. let twoArr= ['startfish', 'earthworm']
Создать новый массив, который содержить все элементы из arr и twoArr.
*/

/*
Задача 15. Написать функцию, которая на вход принимает массив 
и удаляет из этого массива повторяющиеся элементы.
['key', 'space', 'control', 'home', 'home', lock','enter key', 'select', 'escape', 'space', 'enter key']
*/

/*
Задача 16. Написать функцию getArray(array, n), которая возвращает фрагмент массива, 
содержащий первые 'n' элементов массива.
*/
